---
layout: default
title: "Экспорт анимации из Krita в OpenToonz (часть 2)"
permalink: /lesson-02/
---

https://morevnaproject-org.github.io/morevna-school-ru/lesson-02/

В предыдущем видео мы рассказали как экспортировать анимацию из Криты в секвенцию изображений. 

В этом видео мы покажем, как импортировать эту секвенцию в ОпенТунз.

Заставка

Итак, открываем Опен Тунз. Выбираем “открыть другую сцену”. 

Находим где лежит проект Оупен Тунз, который мы скачали. В папке с проектом есть папка “scenes” - заходим туда. 

И вот, нам нужна сцена мэйн. 

Выбираем и нажимаем загрузить.

Сейчас мы сюда импортируем нашу секвенцию. 

Вот здесь в папке у нас лежит секвенция ключевых кадров, которые мы экспортировали в предыдущем видео...

...И всё, что нам нужно сделать, это просто перенести на рабочую область самый первый кадр. 

Далее нажимаем загрузить. Отлично.

У нас импортировалась секвенция. 

Если этого не произошло и импортировался только первый кадр, значит секвенция названа неправильно. 

Следующим шагом, нам нужно настроить длительность каждого кадра.

Сделать это очень просто. 

Выделяем первый кадр потом удерживая shift выделяем последний кадр. 

Затем сверху открываем меню "ячейки" и находим пункт автоэкспоуз. Готово. 

После этой команды все кадры распределятся по таймлайну как раз с тем таймингом с которым анимация была сделана в Крита. 

Наша анимация импортирована в Опен Тунз. 

Можно сохранять сцену, а в следующих уроках мы научимся раскрашивать эту анимацию.
